![GL logo.png]()

Proprietary content. © Great Learning. All Rights Reserved. Unauthorized use or distribution prohibited.


# <font color='green'> **Course 2: Week 3 - Day 02 - Faculty Notebook-01** </font>

## Table of Contents

### <font color='blue'>Reading Data from Different Sources</font>
### <font color='blue'>Merging and Joining</font>
### <font color='blue'>Concatenate</font>
### <font color='blue'>Reshaping the DataFrame</font>

## <font color='Green'>**Reading Data from Different Sources**</font>
Note that the files names are used as examples only. You can try importing your own files to execute the below examples.

**1. Read a `.xlsx` file**

In [ ]:
import pandas as pd
pd.read_excel('example.xlsx')

    Age  Gender    Salary
0  45.0    Male   40000.0
1  12.0    Male       0.0
2  54.0  Female  150000.0
3  26.0    Male   30000.0
4  64.0  Female   15000.0
5  21.0  Female   25600.0

**2. Read a `.zip` file**

In [ ]:
import zipfile
with zipfile.ZipFile('data.zip') as z:
    with z.open('example.csv') as f:
        file = pd.read_csv(f)
        print(file.head())

   Age  Weight (in kg)  Height (in m)
0   45              60           1.35
1   12              43           1.21
2   54              78           1.50
3   26              65           1.21
4   68              50           1.32

**3. Read a `.html` file**

In [ ]:
df = pd.read_html('Sheet1.html', header=1, index_col=0)
df

[   Age  Gender  Salary
 1
 2   45    Male   40000
 3   12    Male       0
 4   54  Female  150000
 5   26    Male   30000
 6   64  Female   15000
 7   21  Female   25600]

**4. Read a `.txt` file**

In [ ]:
data = pd.read_csv('example.txt', sep="\t")
data.head()

       Country  Birth rate  Life expectancy
0      Vietnam       1.822        74.828244
1      Vanuatu       3.869        70.819488
2        Tonga       3.911        72.150659
3  Timor-Leste       5.578        61.999854
4     Thailand       1.579        73.927659

**5. Read a `.json` file**

In [ ]:
pd.read_json('iris.json')

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

**6. Read a `.xml` file**

In [ ]:
# import xml.etree.ElementTree as ET 

# tree = ET.parse("xml_file.xml")
# root = tree.getroot() 

# df_col = ["Name", "Gender", "Marks"]
# rows = []

# for node in root: 
#    name = node.attrib.get("name")
#    gender = node.find("gender").text if node is not None else None
#    marks = node.find("marks").text if node is not None else None
    
#    rows.append({"Name": name, "Gender": gender, 
#                 "Marks": marks})

# xml_df = pd.DataFrame(rows, columns = df_col)
# xml_df

**7. Read a `.txt` files**

In [ ]:
df = pd.read_csv('example.txt', sep='\t')
df

                 Country  Birth rate  Life expectancy
0                Vietnam       1.822        74.828244
1                Vanuatu       3.869        70.819488
2                  Tonga       3.911        72.150659
3            Timor-Leste       5.578        61.999854
4               Thailand       1.579        73.927659
5        Solomon Islands       4.229        67.465195
6              Singapore       1.150        81.641463
7                  Samoa       3.860        72.306390
8            Philippines       3.142        68.484317
9       Papua New Guinea       3.951        62.440610
10           New Zealand       2.160        80.702439
11         New Caledonia       2.141        76.301683
12               Myanmar       2.002        64.662098
13              Mongolia       2.504        68.194976
14            Micronesia       3.451        68.764829
15              Malaysia       2.635        74.024561
16      Macao SAR, China       1.092        80.775317
17               Lao PDR       2.747        67.064000
18                 Korea       1.220        80.761951
19                 Japan       1.390        82.932683
20             Indonesia       2.117        68.889659
21  Hong Kong SAR, China       1.108        82.878049
22                  Guam       2.470        75.994268
23      French Polynesia       2.090        75.076878
24                  Fiji       2.668        69.225829
25       Dem. Rep. Korea       2.022        68.532146
26                 China       1.598        73.273098


##Concatenate
Concatenation is a process of joining objects along a particular axis, with set logic applied along the other axes, if any (a series doesn’t have any other axes)<br>
                   The main parameters involved in pandas concatenation are - object, axis, handling of other axes, and keys


### <font color='Green'>**Syntax of Concatenate:**</font>

pd.concat(objs,axis=0,join='outer',join_axes=None,ignore_index=False)<br>
objs − This is a sequence or mapping of Series, DataFrame, or Panel objects.

axis − {0, 1, ...}, default 0. This is the axis to concatenate along.

join − {‘inner’, ‘outer’}, default ‘outer’. How to handle indexes on other axis. Outer for union and inner for intersection.

ignore_index − boolean, default False. If True, do not use the index values on the concatenation axis. The resulting axis will be labeled 0, ..., n - 1.

join_axes − This is the list of Index objects. Specific indexes to use for the other (n-1) axes instead of performing inner/outer set logic.

**Concatenate Pandas Series**

In [ ]:
import pandas as pd

In [ ]:
# create a series
series_a = pd.Series([101,102,103,104,105,106])
series_b = pd.Series([107,108,109,110,111,112])

In [ ]:
# concatenate the pandas series
pd.concat([series_a,series_b])

0    101
1    102
2    103
3    104
4    105
5    106
0    107
1    108
2    109
3    110
4    111
5    112
dtype: int64

**Add a Hierarchical Index on Pandas Series**

In [ ]:
pd.concat([series_a,series_b], keys = ['a', 'b'])

a  0    101
   1    102
   2    103
   3    104
   4    105
   5    106
b  0    107
   1    108
   2    109
   3    110
   4    111
   5    112
dtype: int64

**Label the Index**

In [ ]:
# 'names' parameter assigns labels to 'keys' and 'indices'
pd.concat([series_a, series_b], keys=['a', 'b'], names=['Series', 'Row ID'])

Series  Row ID
a       0         101
        1         102
        2         103
        3         104
        4         105
        5         106
b       0         107
        1         108
        2         109
        3         110
        4         111
        5         112
dtype: int64

**Concatenating Dataframes**

In [ ]:
df_1 = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'Company':['Apple','Walmart','Intel','cummins','Ford'],
   'Salary':[67000,90000,87000,69000,78000]},
   index=[101,102,103,104,105])

print("The first dataframe is : \n",df_1, "\n\n")

df_2 = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'Company':['Cognizant','Apple','Intel','Cummins','Walmart'],
   'Salary':[89000,80000,79000,97000,88000]},
   index=[101,102,103,104,105])

print("The second dataframe is : \n",df_2)

The first dataframe is :
        Name  Company  Salary
101    Alex    Apple   67000
102     Amy  Walmart   90000
103   Allen    Intel   87000
104   Alice  cummins   69000
105  Ayoung     Ford   78000


The second dataframe is :
       Name    Company  Salary
101  Billy  Cognizant   89000
102  Brian      Apple   80000
103   Bran      Intel   79000
104  Bryce    Cummins   97000
105  Betty    Walmart   88000

**Concatenating Pandas Dataframes using `.concat()`**

In [ ]:
# concatenate the data frame
print(pd.concat([df_1,df_2]))

       Name    Company  Salary
101    Alex      Apple   67000
102     Amy    Walmart   90000
103   Allen      Intel   87000
104   Alice    cummins   69000
105  Ayoung       Ford   78000
101   Billy  Cognizant   89000
102   Brian      Apple   80000
103    Bran      Intel   79000
104   Bryce    Cummins   97000
105   Betty    Walmart   88000

**Combine Pandas Dataframes Horizontally**

In [ ]:
pd.concat([df_1,df_2], axis=1)

       Name  Company  Salary   Name    Company  Salary
101    Alex    Apple   67000  Billy  Cognizant   89000
102     Amy  Walmart   90000  Brian      Apple   80000
103   Allen    Intel   87000   Bran      Intel   79000
104   Alice  cummins   69000  Bryce    Cummins   97000
105  Ayoung     Ford   78000  Betty    Walmart   88000

**Concatenating data frames ignoring index values**

In [ ]:
pd.concat([df_1,df_2], ignore_index=True)

     Name    Company  Salary
0    Alex      Apple   67000
1     Amy    Walmart   90000
2   Allen      Intel   87000
3   Alice    cummins   69000
4  Ayoung       Ford   78000
5   Billy  Cognizant   89000
6   Brian      Apple   80000
7    Bran      Intel   79000
8   Bryce    Cummins   97000
9   Betty    Walmart   88000

**Concatenating Pandas Dataframes using `.append()`**

In [ ]:
df_1.append(df_2)

       Name    Company  Salary
101    Alex      Apple   67000
102     Amy    Walmart   90000
103   Allen      Intel   87000
104   Alice    cummins   69000
105  Ayoung       Ford   78000
101   Billy  Cognizant   89000
102   Brian      Apple   80000
103    Bran      Intel   79000
104   Bryce    Cummins   97000
105   Betty    Walmart   88000

<a id="Merging"> </a>
##Merging and Joining
<table align="left">
    <tr>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>"Merging" two datasets is the process of bringing two datasets together into one, and aligning the rows from each based on common attributes or columns<br>
                    This is achieved by the parameter “on” which allow us to select the common column between two dataframes
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

### <font color='Green'>**Concatenate using `.merge()`**</font>

In [ ]:
my_df1=pd.DataFrame({
 'Product_ID':[101,102,103,104,105,106],
 'Food_Product':['Cakes','Biscuits','Fruit','Beverages','Cakes','Beverages'],
 'Brand':['Baskin Robbins','Blue Riband','Peach','Horlicks','Mars Muffin','Mirinda'], 
})
print("The first dataframe is : \n",my_df1,"\n\n")

my_df2=pd.DataFrame({
 'Product_ID':[104,102,101,103,107,108],
 'Food_Product':['Beverages', 'Biscuits', 'Cakes', 'Fruit', 'Breakfast foods', 'Chips'],
  'Brand':['Coca-Cola', 'Oreo', 'Dunkin Donuts', 'Banana', 'Cream of Wheat', 'Cheetos']  
})
print("The second dataframe is : \n",my_df2)

The first dataframe is :
    Product_ID Food_Product           Brand
0         101        Cakes  Baskin Robbins
1         102     Biscuits     Blue Riband
2         103        Fruit           Peach
3         104    Beverages        Horlicks
4         105        Cakes     Mars Muffin
5         106    Beverages         Mirinda


The second dataframe is :
    Product_ID     Food_Product           Brand
0         104        Beverages       Coca-Cola
1         102         Biscuits            Oreo
2         101            Cakes   Dunkin Donuts
3         103            Fruit          Banana
4         107  Breakfast foods  Cream of Wheat
5         108            Chips         Cheetos

In [ ]:
pd.merge(my_df1, my_df2, on='Product_ID')

   Product_ID Food_Product_x         Brand_x Food_Product_y        Brand_y
0         101          Cakes  Baskin Robbins          Cakes  Dunkin Donuts
1         102       Biscuits     Blue Riband       Biscuits           Oreo
2         103          Fruit           Peach          Fruit         Banana
3         104      Beverages        Horlicks      Beverages      Coca-Cola

The output displays the common 'Product_ID' in the two data frames.

**Merging Using Multiple Keys**

In [ ]:
pd.merge(my_df1, my_df2, on=['Product_ID','Food_Product'])

   Product_ID Food_Product         Brand_x        Brand_y
0         101        Cakes  Baskin Robbins  Dunkin Donuts
1         102     Biscuits     Blue Riband           Oreo
2         103        Fruit           Peach         Banana
3         104    Beverages        Horlicks      Coca-Cola

**Merging on the Basis of Index**

This function helps to merge two dataframes, based on the index of both of them

In [ ]:
pd.merge(my_df1, my_df2, right_index=True, left_index=True)

,Product_ID_x,Food_Product_x,Brand_x,Product_ID_y,Food_Product_y,Brand_y
0,101,Cakes,Baskin Robbins,104,Beverages,Coca-Cola
1,102,Biscuits,Blue Riband,102,Biscuits,Oreo
2,103,Fruit,Peach,101,Cakes,Dunkin Donuts
3,104,Beverages,Horlicks,103,Fruit,Banana
4,105,Cakes,Mars Muffin,107,Breakfast foods,Cream of Wheat
5,106,Beverages,Mirinda,108,Chips,Cheetos

merge() allows you to perform natural join, left join, right join, and full outer join in pandas.

**Understanding the Different Types of Merge:**

Natural join: It keeps only rows that match from the data frames. (how=‘inner’).

Full outer join: It keeps all rows from both data frames. (how=‘outer’).

Left outer join: To include all the rows of your data frame x and only those from y that match. (how=‘left’).

Right outer join: To include all the rows of your data frame y and only those from x that match. (how=‘right’).

**Inner Join:**<br>
It returns only the rows in which the left table has matching keys in the right table.

In [ ]:
print (pd.merge(my_df1, my_df2, on='Product_ID', how='inner'))

   Product_ID Food_Product_x         Brand_x Food_Product_y        Brand_y
0         101          Cakes  Baskin Robbins          Cakes  Dunkin Donuts
1         102       Biscuits     Blue Riband       Biscuits           Oreo
2         103          Fruit           Peach          Fruit         Banana
3         104      Beverages        Horlicks      Beverages      Coca-Cola

**Outer Join:**<br>
It returns all rows from both tables, joining records from the left, which has matching keys in the right table.

In [ ]:
print (pd.merge(my_df1, my_df2, on='Product_ID', how='outer'))

   Product_ID Food_Product_x         Brand_x   Food_Product_y         Brand_y
0         101          Cakes  Baskin Robbins            Cakes   Dunkin Donuts
1         102       Biscuits     Blue Riband         Biscuits            Oreo
2         103          Fruit           Peach            Fruit          Banana
3         104      Beverages        Horlicks        Beverages       Coca-Cola
4         105          Cakes     Mars Muffin              NaN             NaN
5         106      Beverages         Mirinda              NaN             NaN
6         107            NaN             NaN  Breakfast foods  Cream of Wheat
7         108            NaN             NaN            Chips         Cheetos

**Left Outer Join:**<br>
It returns all rows from the left table, and any rows with matching keys from the right table.

In [ ]:
print (pd.merge(my_df1, my_df2, on='Product_ID', how='left'))

   Product_ID Food_Product_x         Brand_x Food_Product_y        Brand_y
0         101          Cakes  Baskin Robbins          Cakes  Dunkin Donuts
1         102       Biscuits     Blue Riband       Biscuits           Oreo
2         103          Fruit           Peach          Fruit         Banana
3         104      Beverages        Horlicks      Beverages      Coca-Cola
4         105          Cakes     Mars Muffin            NaN            NaN
5         106      Beverages         Mirinda            NaN            NaN

**Right Outer Join:**<br>
It returns all rows from the right table, and any rows with matching keys from the left table.

In [ ]:
print(pd.merge(my_df1, my_df2, on='Product_ID', how='right'))

   Product_ID Food_Product_x         Brand_x   Food_Product_y         Brand_y
0         104      Beverages        Horlicks        Beverages       Coca-Cola
1         102       Biscuits     Blue Riband         Biscuits            Oreo
2         101          Cakes  Baskin Robbins            Cakes   Dunkin Donuts
3         103          Fruit           Peach            Fruit          Banana
4         107            NaN             NaN  Breakfast foods  Cream of Wheat
5         108            NaN             NaN            Chips         Cheetos

## Reshaping

**`.stack()` and `.unstack()` in Pandas:**<br>
 Reshaping the data using stack() function in pandas converts the data into stacked format. When more than one column header is present we can stack the specific column header by specified the level. unstack() function converts the data into unstacked format. Let’s see with an example

### <font color='Green'>**Methods of Multi-Index Creation**</font>

In [ ]:
header = pd.MultiIndex.from_product([['Before Course','After Course'],['Marks']])
d=([[82,95],[78,89],[78,87],[76,89],[66,89]])
 
 
my_df = pd.DataFrame(d,
                  index=['Alisa','Bobby','Cathrine','Jack','Mia'],
                  columns=header)
my_df

         Before Course After Course
                 Marks        Marks
Alisa               82           95
Bobby               78           89
Cathrine            78           87
Jack                76           89
Mia                 66           89

In [ ]:
df_stacked = my_df.stack()
print(df_stacked)

                After Course  Before Course
Alisa    Marks            95             82
Bobby    Marks            89             78
Cathrine Marks            87             78
Jack     Marks            89             76
Mia      Marks            89             66

Notice this creates a more complex index which has two levels the first level is index, and the second level is the data. This is called a multi-index. We can convert back to wide table with unstack. This recreates a single index for each line of data.

In [ ]:
df_unstacked = df_stacked.unstack()
print (df_unstacked)

         After Course Before Course
                Marks         Marks
Alisa              95            82
Bobby              89            78
Cathrine           87            78
Jack               89            76
Mia                89            66

`.stack()` function with level 0 argument stacks the column marks after the course and before the course.

In [ ]:
stacked_df_level = my_df.stack(level=0)
stacked_df_level

                        Marks
Alisa    After Course      95
         Before Course     82
Bobby    After Course      89
         Before Course     78
Cathrine After Course      87
         Before Course     78
Jack     After Course      89
         Before Course     76
Mia      After Course      89
         Before Course     66

In [ ]:
stacked_df_level = my_df.stack(level=1)
stacked_df_level

                After Course  Before Course
Alisa    Marks            95             82
Bobby    Marks            89             78
Cathrine Marks            87             78
Jack     Marks            89             76
Mia      Marks            89             66

------
### Happy Learning :)
------